money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен

count = 0 #это счетчик месяцев, стартуем с 0 месяца
a = 1 + increase #проценты с + 1 чтобы считать было удобнее

while money_capital + salary >= spend: #тут запускаем бесконечный цикл, в котором проверяем больше ли зп + подушка расходов, и оно мне будет считать до тех пор пока не будет наоборот
    spend *= a  # это штука, чтобы наши расходы увеличивались с процентами
    money_capital = money_capital + salary - spend #после того как цикл посчитал, оказалось,что деньги еще есть, значит продолжаем цикл, но надо добавить новую зп и считать с новыми расходами
    count += 1 #а эта вещь считает месяцы, после каждой удачной попытки он добавляет месяц,до тех пор пока цикл не прервется

print("Количество месяцев, которое можно протянуть без долгов:", count) #ну и выводим сколько месяцев у нас
