salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.03  # Ежемесячный рост цен
money_capital = 0 #это стартовый капитал, его нет, поэтому 0

a = 1 + increase #тоже проценты с плюс 1, удобнее считать

for i in range(months): #запускаем цикл, тк у нас известно что месяцев 10
    if spend > salary: #это условие, если траты у нас больше зп, то
        money_capital += spend - salary #то считаем сколько нам надо добавить
    spend *= a  #тут траты с процентами, они же повышаются на проценты с каждым месяцем
print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов: {round(money_capital)}") #выводим сколько дене нам надо иметь
